app/controllers/game_controller.rb

  def pick_a_face_ajax
    if params['pick']
      if params['pick'].to_i == session['target'].id
	@current_score.increase
	session['target'] = nil
	render :json => [ true, @current_score.points ]
      else
	@current_score.decrease
	render :json => [ false, @current_score.points ]
      end
    else

      if( params['school'].blank? )
	@target = Photo.find(:first, :order => "rand()", :limit => 1)
---
SELECT * FROM `photos` WHERE (not(id='55') and (school like 'mma')) ORDER BY rand() LIMIT 4