app/controllers/photos_controller.rb

SELECT * FROM `photos` WHERE (`photos`.`id` = 1)
---
  def show
    @photo = Photo.find(params[:id])

SELECT * FROM `photos` WHERE (`photos`.`id` = 22)
---
  def edit
    @photo = Photo.find(params[:id])

SELECT * FROM `photos` WHERE (`photos`.`id` = 22)
UPDATE `photos` SET `nachname` = 'Yürekli', `vorname` = 'Ömer', `updated_at` = '2008-11-30 13:41:34' WHERE `id` = 64
---
  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])

SELECT * FROM `photos` WHERE (`photos`.`id` = 199)
DELETE FROM `photos` WHERE `id` = 199
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy