app/controllers/players_controller.rb

SELECT * FROM `players` WHERE (`players`.`id` = 1)
---
  def show
    @player = Player.find(params[:id])

INSERT INTO `players` (`updated_at`, `username`, `lastlogin`, `created_at`) VALUES('2008-12-08 07:40:38', NULL, NULL, '2008-12-08 07:40:38')
---
  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save